Asher-1/ACloudViewer/plugins/core/Standard/qSAM3D/include/Sam3dWorker.h
// ----------------------------------------------------------------------------
// -                        CloudViewer: www.cloudViewer.org                  -
// ----------------------------------------------------------------------------
// Copyright (c) 2018-2024 www.cloudViewer.org
// SPDX-License-Identifier: MIT
// ----------------------------------------------------------------------------

#pragma once

#include <QImage>
#include <QThread>
#include <atomic>

#include "Sam3dDialog.h"

class Sam3dWorker : public QThread {
    Q_OBJECT

public:
    explicit Sam3dWorker(QObject* parent = nullptr);
    ~Sam3dWorker() override;

    void configure(const Sam3dDialog::Settings& settings);
    QString error() const { return m_error; }
    void run() override;

    void requestCancel();

signals:
    void logMessage(const QString& message);
    void stageChanged(int stage, int step, int total);
    void resultReady(const Sam3dRunResult& result);
    void taskFinished(bool success);

private:
    bool decodeInputImage();
    bool resolveSam3dModels();
    bool applyRmbgMask();
    bool runGeneration();

    Sam3dDialog::Settings m_settings;
    std::atomic<bool> m_cancel{false};
    // Non-premultiplied ARGB32 pipeline input; the object mask, when RMBG
    // runs, is merged straight into its alpha bytes. The image-view borrow
    // maps this storage directly (little-endian BGRA8 + bytesPerLine).
    QImage m_sourceImage;
    QByteArray m_rmbgModel;  // keep-alive for AICore string copies
    QString m_modelsDir;
    QString m_error;
};
